export const questions = [
  {
    title: "Как добавить текст всплывающей подсказки при наведении на ссылку?",
    variants: [
      "С помощью атрибута <title>",
      "С помощью атрибута <alt>",
      "С помощью атрибута <placeholder>",
    ],
    correct: 0,
  },
  {
    title: "Для чего используется атрибут alt в теге <img/> ?",
    variants: [
      "Используется для перехода на другую страницу",
      "Используется для указания пути к картинке",
      "Используется для альтернативного добавления названия или описания",
    ],
    correct: 2,
  },
  {
    title: "Опишите разницу между тегами <p>, <div> , <span>",
    variants: [
      "<p> нужен для создания абзаца, <div> для создания блока, <span> используется как строчный тег",
      "<p> используется как строчный тег, <div> для создания блока, <span> нужен для создания абзаца",
      "<p> нужен для создания абзаца, <div> используется как строчный тег, <span> для создания блока",
    ],
    correct: 0,
  },
  {
    title:
      "Как сделать чтобы ссылка сайта открывалась в новом окне? Как сделать чтобы все ссылки открывались в новом окне?",
    variants: [
      "Первое через  атрибут target, второе указать таргет для всех тегов <a> или в начале разметки написать <base target=’’>",
      "Первое указать в <src> адрес ссылки, второе указать <src> в начале разметки с адресом ссылки",
      "Первое указать в <target> адрес ссылки, второе указать <target> в начале разметки с адресом ссылки",
    ],
    correct: 0,
  },
  // {
  //   title: "",
  //   variants: [],
  //   correct: 0,
  // },
  // {
  //   title: "",
  //   variants: [],
  //   correct: 0,
  // },
  // {
  //   title: "",
  //   variants: [],
  //   correct: 0,
  // },
  // {
  //   title: "",
  //   variants: [],
  //   correct: 0,
  // },
  // {
  //   title: "",
  //   variants: [],
  //   correct: 0,
  // },
  // {
  //   title: "",
  //   variants: [],
  //   correct: 0,
  // },
];
